[
  {
    "id": "Red-Redemption",
    "title": "Red Phoenix's representatives dominates Likhawitan Intramurals 2025",
    "excerpt": "Grade 9–Red Phoenix defeated the Mockingjays, Eagles, and Falcons to win the championship in the Likhawitan Intramurals 2025, held on the stage of Dasmariñas West National High School on August 9, 2025.",
    "content": "Grade 9–Red Phoenix defeated the Mockingjays, Eagles, and Falcons to win the championship in the Likhawitan Intramurals 2025, held on the stage of Dasmariñas West National High School on August 9, 2025.\n\n\n\nThe event began after the Intramurals Level Chant led by Sir Joselito Menduez Almuete.\n\n\n\nBefore the event, participants were asked to compose an original song related to the theme “Kulturang Pinoy.”\n\n\n\nAs the competition began, the Yellow Falcons' representatives entered the stage and performed a piece related to the theme of being Filipino.\n\n\n\nThe Red Phoenix took the stage and performed a piece encouraging the preservation of Filipino traditions and culture despite modernization.\n\n\n\nThe Grade 7 Green Mockingjays went on stage and performed, competing against the Yellow Falcons and Red Phoenix for the championship.\n\n\n\nThe Blue Eagles performed with a style that featured distinct vocals and instrumentals.\n\n\n\nSir Joselito Menduez Almuete announced the Grade 9 Red Phoenix as the champions before the event concluded.\n\n\n\nRed Phoenix representatives Schen Reece Mercado and Glacey Sebia expressed their reaction to the unexpected win.\n\n\n\n\"I'm very happy because it's my first time joining a competition. When it came to making the song, it was really difficult because we only made it in one day, and we practiced it for only two days, so there was a lot of pressure. Winning was really unexpected.\" Sebia happily expressed.",
    "image": "assets/test.jpg",
    "category": "campus",
    "author": "Gelo Bulagnir",
    "tags": ["events", "tradition", "campus"],
    "publishedAt": "2025-08-14T10:30:00+08:00",
    "readMinutes": ""
  },
  {
    "id": "TEMPLATE",
    "title": "TEMPLATE",
    "excerpt": "TEMPLATE BLAH BLAH BLAH",
    "content": "TEMPLATE BLAH BLAH BLAH   bl;as",
    "image": "https://images.unsplash.com/photo-1489365091240-6e96d56e72ab?q=80&w=1200&auto=format&fit=crop",
    "category": "template",
    "author": "Campus Desk",
    "tags": ["events", "tradition", "community"],
    "publishedAt": "2025-08-20T10:30:00+08:00",
    "readMinutes": 4
  }
]

